app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
  def show
    @category = Category.find(params[:id])

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT `categories`.* FROM `categories` WHERE `categories`.`parent_category_id` IS NULL
---
  def edit
    @category = Category.find(params[:id])
    @parent_categories =  Category.find_all_by_parent_category_id(nil)