app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`status` = 'published' AND `posts`.`order` = 'created_at ASC' AND `posts`.`id` = 0 LIMIT 1
INSERT INTO `posts` (`author_id`, `category_id`, `content`, `created_at`, `later_post_id`, `previous_post_id`, `status`, `title`, `updated_at`) VALUES (NULL, NULL, '', '2012-08-17 21:43:01', NULL, 1, '', 'POST 4', '2012-08-17 21:43:01')
UPDATE `posts` SET `later_post_id` = 6, `updated_at` = '2012-08-17 21:43:52' WHERE `posts`.`id` = 1
---
  def create
    @post = Post.new(params[:post])
    @post.title = (@post.title).upcase
    @previous_post =  Post.find(:all, :order =>'created_at ASC', :conditions => {:status =>'Published'})
    @post.later_post_id = @previous_post.first.id
    @post.author_id = session[:user_id]
    respond_to do |format|
      if @post.save
        @previous_post.first.previous_post_id = @post.id
        @previous_post.first.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`status` = 'Published' ORDER BY created_at ASC
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`id` DESC LIMIT 1
---
  def last
    posts =  Post.find(:all, :order =>'created_at ASC', :conditions => {:status =>'Published'})
    @post = posts.first